In [36]:
import pandas as pd

In [87]:
hd = pd.read_csv('hiring.csv')

In [88]:
hd

  experience  test_score  interview_s  salary
0        two         8.0            9   50000
1        six         8.0            6   45000
2       five         6.0            7   60000
3        two        10.0           10   65000
4      seven         9.0            6   70000
5      three         7.0           10   62000
6        ten         NaN            7   72000
7     eleven         7.0            8   80000

In [89]:
hd=hd.rename(columns={'test_score':'tests'})
hd

  experience  tests  interview_s  salary
0        two    8.0            9   50000
1        six    8.0            6   45000
2       five    6.0            7   60000
3        two   10.0           10   65000
4      seven    9.0            6   70000
5      three    7.0           10   62000
6        ten    NaN            7   72000
7     eleven    7.0            8   80000

In [51]:
from word2number import w2n

In [83]:
hiring_data['test_score'] = hiring_data['test_score'].fillna(hiring_data['test_score'].mean()).round(2)

In [84]:
hiring_data

   experience  test_score  interview_s  salary
0           2        8.00            9   50000
1           6        8.00            6   45000
2           5        6.00            7   60000
3           2       10.00           10   65000
4           7        9.00            6   70000
5           3        7.00           10   62000
6          10        7.86            7   72000
7          11        7.00            8   80000

In [78]:
hiring_data.experience = hiring_data.experience.apply(w2n.word_to_num)

In [79]:
hiring_data

   experience  test_score  interview_s  salary
0           2    8.000000            9   50000
1           6    8.000000            6   45000
2           5    6.000000            7   60000
3           2   10.000000           10   65000
4           7    9.000000            6   70000
5           3    7.000000           10   62000
6          10    7.857143            7   72000
7          11    7.000000            8   80000

In [80]:
from sklearn import linear_model

In [81]:
multi_reg = linear_model.LinearRegression()

In [85]:
multi_reg.fit(hiring_data[['experience', 'test_score', 'interview_s']], hiring_data['salary'])

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [86]:
multi_reg.predict([[12,7,10]])

array([92967.49776094])